jmeter/resultados/html_100/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 3386,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1725.4238038984076,
    "medianResTime" : 1771.0,
    "minResTime" : 155.0,
    "maxResTime" : 3732.0,
    "pct1ResTime" : 1928.3000000000002,
    "pct2ResTime" : 2002.0,
    "pct3ResTime" : 2474.26,
    "throughput" : 54.88289164437961,
    "receivedKBytesPerSec" : 6698.830325213753,
    "sentKBytesPerSec" : 7.289134046519167
  },
  "GET /comanda/api/comandas" : {
    "transaction" : "GET /comanda/api/comandas",
    "sampleCount" : 3386,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1725.4238038984076,
    "medianResTime" : 1771.0,
    "minResTime" : 155.0,
    "maxResTime" : 3732.0,
    "pct1ResTime" : 1928.3000000000002,
    "pct2ResTime" : 2002.0,
    "pct3ResTime" : 2474.26,
    "throughput" : 54.88289164437961,
    "receivedKBytesPerSec" : 6698.830325213753,
    "sentKBytesPerSec" : 7.289134046519167
  }
}